Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/include/pic32cx2051mtsh128s1.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M4 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnSUPC_Handler;                         /*   0 Supply Controller (SUPC) */
  void* pfnRSTC_Handler;                         /*   1 Reset Controller (RSTC) */
  void* pfnRTC_Handler;                          /*   2 Real-time Clock (RTC) */
  void* pfnRTT_Handler;                          /*   3 Real-time Timer (RTT) */
  void* pfnDWDT0_Handler;                        /*   4 Dual Watchdog Timer (DWDT) */
  void* pfnDWDT1_Handler;                        /*   5 Dual Watchdog Timer (DWDT) */
  void* pfnPMC_Handler;                          /*   6 Power Management Controller (PMC) */
  void* pvReserved7;
  void* pvReserved8;
  void* pfnFLEXCOM0_Handler;                     /*   9 Flexible Serial Communication (FLEXCOM0) */
  void* pfnFLEXCOM1_Handler;                     /*  10 Flexible Serial Communication (FLEXCOM1) */
  void* pfnFLEXCOM2_Handler;                     /*  11 Flexible Serial Communication (FLEXCOM2) */
  void* pfnFLEXCOM3_Handler;                     /*  12 Flexible Serial Communication (FLEXCOM3) */
  void* pfnFLEXCOM4_Handler;                     /*  13 Flexible Serial Communication (FLEXCOM4) */
  void* pfnFLEXCOM5_Handler;                     /*  14 Flexible Serial Communication (FLEXCOM5) */
  void* pfnFLEXCOM6_Handler;                     /*  15 Flexible Serial Communication (FLEXCOM6) */
  void* pfnFLEXCOM7_Handler;                     /*  16 Flexible Serial Communication (FLEXCOM7) */
  void* pfnPIOA_Handler;                         /*  17 Parallel Input/Output Controller (PIOA) */
  void* pfnPIOA_SEC_Handler;                     /*  18 Parallel Input/Output Controller (PIOA) */
  void* pfnPIOB_Handler;                         /*  19 Parallel Input/Output Controller (PIOB) */
  void* pfnPIOB_SEC_Handler;                     /*  20 Parallel Input/Output Controller (PIOB) */
  void* pfnPIOC_Handler;                         /*  21 Parallel Input/Output Controller (PIOC) */
  void* pfnPIOC_SEC_Handler;                     /*  22 Parallel Input/Output Controller (PIOC) */
  void* pfnQSPI_Handler;                         /*  23 Quad Serial Peripheral Interface (QSPI) */
  void* pfnADC_Handler;                          /*  24 Analog-to-Digital Converter (ADC) */
  void* pfnACC_Handler;                          /*  25 Analog Comparator Controller (ACC) */
  void* pvReserved26;
  void* pvReserved27;
  void* pfnIPC0_Handler;                         /*  28 Inter-processor Communication (IPC0) */
  void* pfnSLCDC_Handler;                        /*  29 Segment LCD Controller (SLCDC) */
  void* pfnMEM2MEM0_Handler;                     /*  30 Memory to Memory (MEM2MEM0) */
  void* pfnTC0_CH0_Handler;                      /*  31 Timer Counter (TC0) */
  void* pfnTC0_CH1_Handler;                      /*  32 Timer Counter (TC0) */
  void* pfnTC0_CH2_Handler;                      /*  33 Timer Counter (TC0) */
  void* pfnTC1_CH0_Handler;                      /*  34 Timer Counter (TC1) */
  void* pfnTC1_CH1_Handler;                      /*  35 Timer Counter (TC1) */
  void* pfnTC1_CH2_Handler;                      /*  36 Timer Counter (TC1) */
  void* pfnTC2_CH0_Handler;                      /*  37 Timer Counter (TC2) */
  void* pfnTC2_CH1_Handler;                      /*  38 Timer Counter (TC2) */
  void* pfnTC2_CH2_Handler;                      /*  39 Timer Counter (TC2) */
  void* pfnTC0_C0SEC_Handler;                    /*  40 Timer Counter (TC0) */
  void* pfnTC0_C1SEC_Handler;                    /*  41 Timer Counter (TC0) */
  void* pfnTC0_C2SEC_Handler;                    /*  42 Timer Counter (TC0) */
  void* pfnTC1_C0SEC_Handler;                    /*  43 Timer Counter (TC1) */
  void* pfnTC1_C1SEC_Handler;                    /*  44 Timer Counter (TC1) */
  void* pfnTC1_C2SEC_Handler;                    /*  45 Timer Counter (TC1) */
  void* pfnTC2_C0SEC_Handler;                    /*  46 Timer Counter (TC2) */
  void* pfnTC2_C1SEC_Handler;                    /*  47 Timer Counter (TC2) */
  void* pfnTC2_C2SEC_Handler;                    /*  48 Timer Counter (TC2) */
  void* pvReserved49;
  void* pvReserved50;
  void* pvReserved51;
  void* pvReserved52;
  void* pvReserved53;
  void* pvReserved54;
  void* pvReserved55;
  void* pvReserved56;
  void* pvReserved57;
  void* pvReserved58;
  void* pvReserved59;
  void* pvReserved60;
  void* pfnMATRIX1_Handler;                      /*  61 AHB Bus Matrix (MATRIX1) */
  void* pfnSUPC_WKUP3_Handler;                   /*  62 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP4_Handler;                   /*  63 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP5_Handler;                   /*  64 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP6_Handler;                   /*  65 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP7_Handler;                   /*  66 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP8_Handler;                   /*  67 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP9_Handler;                   /*  68 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP10_Handler;                  /*  69 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP11_Handler;                  /*  70 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP12_Handler;                  /*  71 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP13_Handler;                  /*  72 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP14_Handler;                  /*  73 Supply Controller (SUPC) */
  void* pfnSUPC_WKUP15_Handler;                  /*  74 Supply Controller (SUPC) */
  void* pvReserved75;
  void* pfnEMAFE_SLINK_Handler;                  /*  76 Energy Metering Analog Front End (EMAFE) */
  void* pfnEMAFE_DATA_Handler;                   /*  77 Energy Metering Analog Front End (EMAFE) */
  void* pfnMEM2MEM1_Handler;                     /*  78 Memory to Memory (MEM2MEM1) */
  void* pfnTC3_CHANNEL0_Handler;                 /*  79 Timer Counter (TC3) */
  void* pfnTC3_CHANNEL1_Handler;                 /*  80 Timer Counter (TC3) */
  void* pfnTC3_CHANNEL2_Handler;                 /*  81 Timer Counter (TC3) */
  void* pfnTC3_C0SEC_Handler;                    /*  82 Timer Counter (TC3) */
  void* pfnTC3_C1SEC_Handler;                    /*  83 Timer Counter (TC3) */
  void* pfnTC3_C2SEC_Handler;                    /*  84 Timer Counter (TC3) */
  void* pfnPIOD_Handler;                         /*  85 Parallel Input/Output Controller (PIOD) */
  void* pfnPIOD_SEC_Handler;                     /*  86 Parallel Input/Output Controller (PIOD) */
  void* pfnUART_Handler;                         /*  87 Universal Asynchronous Receiver Transmitter (UART) */
  void* pfnIPC1_Handler;                         /*  88 Inter-processor Communication (IPC1) */
  void* pfnMCSPI_Handler;                        /*  89 Multi Channel Serial Peripheral Interface (MCSPI) */
  void* pfnPWM_Handler;                          /*  90 Pulse Width Modulation Controller (PWM) */
  void* pvReserved91;
  void* pvReserved92;
  void* pvReserved93;
  void* pfnMATRIX2_Handler;                      /*  94 AHB Bus Matrix (MATRIX2) */
  void* pfnMATRIX3_Handler;                      /*  95 AHB Bus Matrix (MATRIX3) */
} DeviceVectors;

